app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY id DESC
SELECT "categories".* FROM "categories"
---
  def index
    @posts = Post.all.order('id DESC')
    @categories = Category.all

INSERT INTO "posts" ("category", "title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category", "Tes"], ["title", ""], ["content", ""], ["user_id", 7], ["created_at", "2015-02-27 15:28:05.288444"], ["updated_at", "2015-02-27 15:28:05.288444"]]
SELECT "categories".* FROM "categories"
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Tes"], ["created_at", "2015-02-27 15:28:05.294542"], ["updated_at", "2015-02-27 15:28:05.294542"]]
---
 def create
    @post = Post.new(post_params)
    @post.user = current_user
    respond_to do |format|
      if @post.save
        format.html { redirect_to @post, notice: 'Post was successfully created.' }
        format.json { render :show, status: :created, location: @post }
	@c = @post.category
	@category= @c.to_s
	@categories= @category.split(',')
	@allcategories= Category.all
	@flag = false
	@categories.each do |category|
		@flag=false
		@allcategories.each do |c|
			if (category.include? c.name)
				@flag=true
			end
		end
		if @flag == false
			Category.create(:name => category)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    if @post.user != current_user
      redirect_to posts_path, :notice => "Access Denied"
    end
    @post.destroy